Repository: GhalaAlnmasi/UNIT-2-PRJECT
Catalog: Athar/main/locale/*/LC_MESSAGES/django.po
Languages: ar

source: About Us
ar: حول

source: About Atharana
ar: عن آثــارانــا

source: Our aim on this website is to showcase the beauty of Saudi heritage and its evolution over time,
ar: هدف في هذا الموقع إلى إبراز جمال التراث السعودي وتطوره عبر الزمن

source: from the authenticity of the past to the modernity of the present.
ar: من أصالة الماضي إلى حداثة الحاضر

source: Our site combines a rich cultural identity with an innovative,
ar: يجمع موقعنا بين الهوية الثقافية العريقة والرؤية المستقبلية المبتكرة

source: forward-looking vision to offer a unique experience that reflects the spirit of the Kingdom.
ar: لتقديم تجربة فريدة تعكس روح المملكة.

source: Return to homepage
ar: العودة للرئيسية

source: Atharana
ar: أثــارانــا

source: Home
ar: الرئيسية

source: Regions
ar: المناطق

source: About
ar: حول

source: © 2025 Atharana. All rights reserved.
ar: © 2025 آثارنا. جميع الحقوق محفوظة.

source: Home Page
ar: الرئيسية

source: Discover the Historical of Saudi Arabian cities
ar: السعودية العربية المملكة مدن آثار اكتشف

source: Explore the ruins
ar: استكشف الآثار

source: From Riyadh, the birthplace of the modern state, to Diriyah, steeped in the rich history of the past,
ar: من الرياض حيث شهدت ولادة الدولة الحديثة، إلى الدرعية التي تحمل عبق الماضي الأصيل،

source: this site offers a window into the Kingdom's history through its historical landmarks and distinctive military sites.
ar: يقدم هذا الموقع نافذة على تاريخ المملكة من خلال آثارها ومواقعها التاريخية المميزة.

source: Every fortress, every palace, and every street tells a story of civilization and heritage, and every visit here takes
ar: كل حصن، كل قصر، وكل شارع يحكي قصة حضارة وتراث، وكل زيارة هنا تأخذك في رحلة

source: you on a journey between past and present, revealing the diverse identities of Saudi cities across the centuries.
ar: زمنية بين الماضي والحاضر، لتعرف كيف تشكلت هوية المدن السعودية عبر القرون

source: Riyadh
ar: الرياض

source: Ash-Sharqiyah
ar: الشرقية

source: Qassim
ar: القصيم

source: Makkah
ar: مكة المكرمة

source: Madinah
ar: المدينة المنورة

source: Tabuk
ar: تبوك

source: Al-Jouf
ar: الجوف

source: Hail
ar: حايل

source: Al-Hudud Ash-Shamaliyah
ar: الحدود الشمالية

source: Asir
ar: عسير

source: Al-Baha
ar: الباحة

source: Jazan
ar: جازان

source: Najran
ar: نجران

source: A city that started from clay, then became a full horizon.
ar: مدينة بدأت من الطين، ثم صارت أفقًا كاملًا.

source: Al-Masmak Palace
ar: قصر المصمك

source: A clay fortress with sharp lines resembling the first words of a long novel. Here the unification began, and here the moment of Riyadh’s recapture in 1902 occurred. Every wall looks like an open historical page.
ar: حصنٌ طينيٌّ بخطوطٍ حادةٍ تُشبه الكلمات الأولى من روايةٍ طويلة.هنا بدأ التوحيد، وهنا وقعت لحظة استعادة الرياض عام ١٩٠٢.كل جدارٍ فيه يبدو كصفحةٍ تاريخيةٍ مفتوحة.

source: Al-Turaif District - Diriyah (UNESCO site)
ar: حي الطريف - الدرعية (موقع اليونسكو)

source: A clay city on the slopes of Wadi Hanifah. Narrow alleys, but vast memory. From here the first Saudi state arose, and the Najdis’ voices rose in architecture, jurisprudence, and politics.
ar: مدينة طينية على سفوح وادي حنيفة. أزقتها ضيقة، لكن ذاكرتها واسعة.ومن هنا قامت الدولة السعودية الأولى، وارتفعت أصوات النجديين فيهالهندسة المعمارية، والفقه، والسياسة.

source: Wadi Hanifah
ar: وادي حنيفة

source: A green strip cutting through the desert. It was a caravan route and a center of settlement; today it’s an extended oasis combining the city with its natural history.
ar: شريط أخضر يشق الصحراء. كان طريقًا للقوافل ومركزًا للاستيطان؛ واليوم هو واحة ممتدة تجمع بين المدينةوتاريخها الطبيعي.

source: A heart where people walk from all directions.
ar: قلب يمشي اليه الناس من جميع الاتجاهات.

source: Jabal Noor – Hira Cave
ar: جبل النور – غار حراء

source: The mountain that witnessed the start of revelation. The mountain does not comment on history, but it remains standing as if it knows more than it says.
ar: الجبل الذي شهد بداية الوحي.لا يُعلّق الجبل على التاريخ، بل يبقى واقفًا كأنه يعرف أكثر مما يقول.

source: Al-Bay’ah Mosque
ar: مسجد البيعة

source: Site of the pledge of allegiance of the Ansar to the Prophet ﷺ. Simple in form, heavy in symbolism. Here, words were not mere words, they were the foundation of destiny.
ar: موقع بيعة الأنصار للنبي ﷺ. بسيط في شكله، ثري بالرمزية.هنا، لم تكن الكلمات مجرد كلمات، بل كانت أساس المصير.

source: Makkah Museum of Heritage and Antiquities
ar: متحف مكة للتراث والآثار

source: An old Ottoman house turned into an open memory: tools, manuscripts, old mosque doors, and pilgrims’ clothes from centuries past.
ar: منزل عثماني قديم تحوّل إلى ذاكرة مفتوحة: أدوات، مخطوطات،أبواب مساجد قديمة، وملابس حجاج من قرون مضت.

source: Peace walks on the ground here.
ar: السلام يمشي على الأرض هنا.

source: Al-Hijr (Madain Saleh / UNESCO)
ar: الحجر (مدائن صالح / اليونسكو)

source: A rock city carved 2000 years ago. The facades look like hanging doors waiting for someone to open them. Every tomb carries a name and a hand-etched story.
ar: مدينة صخرية منحوتة قبل ألفي عام. تبدو واجهاتها كأبواب معلقةنتظر من يفتحها. كل قبر فيها يحمل اسمًا وحكاية محفورة باليد.

source: Dadan
ar: دادان

source: Capital of the Dadan and Lihyan kingdoms. The rock tombs are high as if windows overlooking a bygone time. A key trading station on the incense route.
ar: دادان عاصمة مملكتي دادان ولحيان. المدافن الصخرية مرتفعة كأنهانوافذ تطل على زمن غابر. كانت محطة تجارية مهمة على طريق البخور.

source: Quba Mosque
ar: مسجد قباء

source: The first mosque in Islam. The place relies not on the beauty of details but on the beauty of history. It’s the beginning of the community before it was a building.
ar: أول مسجد في الإسلام. المكان لا يعتمد على جمال التفاصيل بقدر ما يعتمد على جمال التاريخ. هو بداية الجماعة قبل أن يكون بناءً.

source: Where the sea meets the palm trees and the old salt.
ar: حيث يلتقي البحر بالنخل وبالملح القديم.

source: Al-Ahsa Oasis (UNESCO)
ar: واحة الأحساء (يونسكو)

source: Seas of palm trees. Water here is not just a river, but memory. The greatest continuously inhabited oasis in the world.
ar: بحار من النخيل. الماء هنا ليس نهرًا، بل ذاكرة.أعظم واحة مأهولة باستمرار في العالم.

source: Ibrahim Palace (Al-Hofuf)
ar: قصر إبراهيم (الهفوف)

source: An Ottoman fortress combining Najdi and Ottoman styles. Its walls are like layers of accumulated history.
ar: حصن عثماني يجمع بين النمط النجدي والعثماني.جدرانه كأنها طبقات تاريخ متراكمة.

source: Historical Port of Al-Aqeer
ar: ميناء العقير التاريخي

source: An old gateway to the Gulf; ships from India and East Africa anchored here. A place resembling an open door to maritime history.
ar: بوابة قديمة للخليج، كانت ترسو عنده السفن القادمة من الهند وشرق إفريقيا.مكان يشبه بابًا مفتوحًا للتاريخ البحري.

source: The heart of hot Najd… and the warmth of heritage.
ar: قلب نجد الحارّ… ودفء التراث.

source: Al-Shanna Tower
ar: برج الشنانة

source: An archaeological edifice that tells the story of the heroism shown by the people of Al-Ras and the strength of Bass in confronting aggression. It was a witness to their courage and sacrifice in defending their town.
ar: صرح أثري يروي قصة بطولةأهل الراس وصمود أهل البص في مواجهة العدوان.كان شاهدًا على شجاعتهم وتضحياتهم في الدفاع عن مدينتهم.

source: Al Musawkaf Traditional Market
ar: سوق المسوكف التراثي

source: A market that was a meeting point for traders, agriculture, and horses. Its scent is a mix of dates, coffee, and sun.
ar: سوق كان ملتقى التجار والزراعة والخيل. رائحته خليط من تمر وقهوة وشمس.

source: Antarah's Palace and Rock
ar: صخرة عنترة

source: A rock are two archaeological sites associated with the pre-Islamic poet Antarah Ibn Shaddad, who resided between the town of Qusayba and the Uyun al-Jiwa Governorate, within Qassim Province at the heart of the Kingdom of Saudi Arabia.
ar: الصخرتان موقعان أثريان مرتبطان بالشاعر الجاهلي عنترة بن شداد،الذي سكن بين بلدة قصيبة وعيون الجواء،التابعة لمنطقة القصيم في قلب المملكة العربية السعودية.

source: Here’s the north that keeps its shadow long… a calm desert, and valleys that whisper.
ar: هنا الشمال الذي يحتفظ بظلّه طويلًا… صحراء هادئة، ووديان تتكلم بهمس.

source: Tabuk Castle
ar: قلعة تبوك

source: A fortress guarded by silent stone walls, a station for caravans and pilgrims. Armies, travelers, and worshippers passed, yet it remains… only watching.
ar: حصن تحرسه جدران حجرية صامتة، كان محطة للقوافل والحجاج.مرّت عليه جيوش ورحالة ومصلّون، لكنه لا يتغير… فقط يراقب.

source: Ain Al-Sukkar (Ancient Springs)
ar: عين السكر (العيون الأثرية)

source: Flowing water since ancient times; humans carved life and agriculture around it. Water here is not ordinary; it is a sign of survival.
ar: عيون ماء جارية منذ القدم، نقش الإنسان حولها الحياة والزراعة.الماء هنا لا يُرى كعادي؛ هو دليل نجاة.

source: Wadi Al-Dissa
ar: وادي الديسة

source: A green mountain canyon in the middle of the desert. Its rocky walls look like gates to an ancient city forgotten by time.
ar: أخدود جبلي أخضر وسط الصحراء. جدرانه صخرية شاهقةكأنها بوابات لمدينة قديمة نسيها الزمن.

source: Black mountains, red inscriptions, and silence filled with stories of those who passed before us.
ar: جبال سوداء، نقوش حمراء، وصمت يمتلئ بقصص من مرّوا قبلنا.

source: Jubbah (Rock Art / UNESCO)
ar: جبة (النقوش الصخرية)(يونسكو)

source: Drawings of humans and animals thousands of years old. Ancestors drew their daily life on stone instead of paper.
ar: رسومات بشر وحيوانات تعود لآلاف السنين.كأن الأسلاف رسموا يومياتهم على حجر بدل الورق.

source: Barzan Tower
ar: برج برزان

source: A watchtower built in the late 19th century and renovated in 1910 by Muhammad bin Qasim Al Thani.
ar: برج مراقبة بُني في أواخر القرن التاسع عشر، وجُدّد عام ١٩١٠ على يد محمد بن قاسم آل ثاني.

source: Al-Qishlah Palace
ar: قصر القشلة

source: An old Ottoman administrative building. Its square, strong shape resembles the idea of “order” as cities learned early organization.
ar: مبنى إداري عثماني قديم. شكله مربع وقوي، يشبه فكرة «النظام»حين كانت المدن تتعلم التنظيم الأول.

source: A region that knows the value of water in the desert… thus becoming an oasis of civilizations.
ar: منطقة تعرف قيمة الماء في الصحراء… لذلك صارت واحة للحضارات.

source: Marid Castle – Dumat Al-Jandal
ar: قلعة مارد – دومة الجندل

source: A tall stone castle standing proudly. Said “Marid rebelled against whoever tried to break it,” and it still supports this saying.
ar: قلعة حجرية عالية تقف بشموخ.يقال «تمرد مارد على من حاول كسره»، والقلعة حتى الآن تؤيد القول.

source: Omar Ibn Al-Khattab Mosque in Dumat Al-Jandal
ar: مسجد عمر بن الخطاب

source: One of the oldest surviving mosques. Simple stone construction, preserving centuries of impact as if breathing quietly.
ar: أحد أقدم المساجد الباقية.بناؤه حجري بسيط، لكنه يحفظ أثر القرون كأنه يتنفس بهدوء.

source: Dumat Al-Jandal Lake
ar: بحيرة دومة الجندل

source: Water surprises you in the desert depths. Not just an irrigation source, but a full-life hub.
ar: ماء يفاجئك في عمق الصحراء.لم يكن مجرد مصدر ري، بل محور حياة كاملة.

source: Al-Hudud Ash-Shamaliyah
ar: الحدود الشمالية

source: Vast land, low sky, and ruins standing as markers of the old passage.
ar: أرض واسعة، سماء منخفضة، وآثار تقف كعلامات للمرور القديم.

source: King Abdulaziz Palace in Linah
ar: قصر الملك عبد العزيز بلينه

source: A royal palaces ordered to be built by the Founding King Abdulaziz Bin Abdulrahman Al Saud in various regions of the Kingdom of Saudi Arabia after its unification in 1932.
ar: قصور ملكية أمر ببنائها الملك المؤسس عبد العزيز بن عبد الرحمن آل سعودفي مختلف مناطق المملكة العربية السعودية بعد توحيدها عام ١٩٣٢.

source: The Emirate Palace in Ar'ar
ar: قصر الإمارة

source: It is considered one of the oldest palaces in the Kingdom. The palace is divided into several rooms with different uses, and specific types of mountain stones were used in its construction.
ar: يُعتبر من أقدم قصور المملكة. ينقسم القصر إلى عدة غرف ذات استخدامات مختلفة،وقد استُخدمت في بنائه أنواع محددة من الأحجار الجبلية.

source: Linah Heritage Village
ar: قرية لينه التراثية

source: A Village built during the reign of the Founding King Abdulaziz Bin Abdulrahman Al Saud during the unification of the Kingdom, the village is distinguished by its market where various goods and products were displayed.
ar: قرية بُنيت في عهد الملك المؤسس عبد العزيز بن عبد الرحمن آل سعود، رحمه الله،إبان توحيد المملكة. تتميز القرية بسوقها الذي عُرضت فيه مختلف البضائع والمنتجات.

source: Wet mountains, suspended villages, and fog walking like a visitor who knows the way.
ar: جبال رطبة، قرى معلّقة، وضباب يمشي مثل زائر يعرف الطريق.

source: Dhi Ayn Heritage Village
ar: قرية ذي عين التراثية

source: Built of white stone on a green hill. Looks like a painted canvas, yet very real.
ar: مبنية بالحجر الأبيض فوق ربوة خضراء. تشبه لوحة مرسومة، لكنها حقيقية جدًا.

source: Matair Al-Aish Archaeological Village
ar: قرية مطير العيش الأثرية

source: The historic village of Mutair Al-Aish is rich in many historical and archaeological monuments, which are part of the barren Bani Assem region and surrounded by mountainous areas that reflect the beauty of nature.
ar: تزخر قرية مطير العيش التاريخية بالعديد من المعالم التاريخية والأثرية،وهي جزء من منطقة بني عاصم القاحلة،وتحيط بها مناطق جبلية تعكس جمال الطبيعة.

source: Bani Kabir
ar: بني كبير

source: A large building center is located in the northern part of Beljarshi Governorate and is 12 km² from the headquarters of the governorate, and in the southeast of the city of Al-Baha.
ar: يقع مركز بناء كبير في الجزء الشمالي من محافظة بلجرشي،ويبعد ١٢ كيلومترًا مربعًا عن مقر المحافظة،وفي جنوب شرق مدينة الباحة.

source: The south that resembles no one… colored stones, and fog touching the mountains like a greeting.
ar: الجنوب الذي لا يشبه أحد… حجارة ملوّنة، وضباب يمسّ الجبال كتحية.

source: Rijal Almaa Village (UNESCO candidate)
ar: قرية رجال ألمع (يونسكو مرشّح)

source: Stone houses with colored windows, as if walls wear jewelry. The village is a stone poem.
ar: منازل حجرية بنوافذ ملونة، كأن الجدران ترتدي حُلي.القرية قصيدة حجر.

source: Jabal Al-Souda
ar: جبل السودة

source: The highest mountains in the kingdom. Clouds here are not above you, but around you.
ar: أعلى جبال المملكة. السحب هنا ليست فوقك… بل حولك

source: Hanging Al-Habla Village
ar: قرية الحبلة المعلقة

source: Built on a steep cliff, as if a brave decision against gravity.
ar: مبنية على جرف شاهق. كأنها قرار شجاع ضد الجاذبية.

source: Warm sea, coral islands, and a maritime culture that never stops singing.
ar: بحر دافئ، وجزر مرجانية، وثقافة بحرية لم تتوقف عن الغناء.

source: Farasan Island
ar: جزيرة فرسان

source: Marine reserve with coral beaches. Water here is like glass.
ar: محمية بحرية وشواطئ مرجانية. الماء هنا يشبه الزجاج.

source: Luqman Castle
ar: قلعة لقمان

source: An old stone fortress on a hill overlooking the sea.
ar: قلعة حجرية قديمة تقف على تلة وتطل على البحر.

source: Al-Darb Archaeological Road
ar: الدرب الأثري

source: An old route linking coastal villages, still walking lightly through history.
ar: طريق قديم كان يربط القرى الساحلية، لا يزال يمشي بخطى خفيفة عبر التاريخ.

source: South with the taste of dark coffee… civilizations crossed from Yemen to the peninsula.
ar: جنوبٌ له طعم القهوة الغامق… وحضارات عبرت من اليمن نحو الجزيرة.

source: Aba Al-Saud Heritage District
ar: حي أبا السعود التراثي

source: Tall clay houses with small windows. Like towers made of clay.
ar: بيوت طينية عالية لها نوافذ صغيرة. أشبه بأبراج من الطين.

source: Najran Rock Inscriptions
ar: رقوش نجران الصخرية

source: Ancient southern Arabic writings. Every symbol looks like a pre-language word.
ar: كتابات عربية جنوبية قديمة. كل رمز فيها يشبه كلمة قبل اللغة الحديثة.

source: Al-Okhdood Archaeological City
ar: مدينة الأخدود الأثرية

source: It consists of a surrounding wall, remnants of buildings, artifacts, tombs, inscriptions, and drawings. Its oldest artifacts date back to the Stone Age, while its most recent ones belong to the Islamic period, including artifacts from the Umayyad and Abbasid eras.
ar: تتكون من سور محيط، وبقايا مبانٍ، وقطع أثرية، ومقابر، ونقوش، ورسومات.تعود أقدم آثارها إلى العصر الحجري، بينما تعود أحدثها إلى العصر الإسلامي،بما في ذلك قطع أثرية من العصرين الأموي والعباسي.
